app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save and @user.create_player
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "login_count", "persistence_token", "last_login_ip", "login", "last_login_at", "email") VALUES('1EIlPl8Idxb9Sxe7hWe2', '2010-04-08 09:10:40', '2010-04-08 09:10:40', '281d7d0a1b0fd30f860d2ea922ec0d83d617ccf8c12275685c920b23693953c1d8c10b7606c942a667d9c5d95f22fa531c9ab94bce8d036cc16e59e57bca0dff', 'XvnwQQz-p2QZrMdaLiue', '2010-04-08 09:10:40', 0, '98.27.162.52', 'EszjGgOrvV7wKKSp3qHS', '2010-04-08 09:10:40', 1, 'e882cacf378947ffa37758e3a529f27423f36dc53c03821c5f063b34504d6c48139a0ff97ee5d65ade54dd596439149636156fdd0291d826e6c433220bea5bc5', NULL, 'fractalis', NULL, 'srallya@gmail.com')